HAT_CONFIG = {
    "ankara-istanbul": [
        ("Ankara YHT", 39.9208, 32.8541),
        ("Eryaman", 39.9534, 32.6496),
        ("Polatlı", 39.5845, 32.1454),
        ("Eskişehir", 39.7767, 30.5206),
        ("Bozüyük", 39.9078, 29.9234),
        ("Bilecik", 40.1429, 29.9793),
        ("Arifiye", 40.7393, 30.4035),
        ("İzmit", 40.7654, 29.9464),
        ("Gebze", 40.8057, 29.4307),
        ("Pendik", 40.8835, 29.2290),
        ("Bostancı", 40.9618, 29.0867),
        ("Söğütlüçeşme", 40.9855, 29.0307),
        ("Bakırköy", 40.9730, 28.8690),
        ("Halkalı", 41.0031, 28.7789)
    ],
    "istanbul-konya": [
        ("Söğütlüçeşme", 40.9855, 29.0307),
        ("Konya", 37.8724, 32.4918)
    ],
    "ankara-sivas": [
        ("Ankara YHT", 39.9208, 32.8541),
        ("Kayaş", 39.9464, 32.9286),
        ("Sivas", 39.7477, 37.0179)
    ]
}
